In [110]:
import numpy as np
import pandas as pd

In [111]:
test_df = pd.read_csv('./Data/act_test.csv')
test_df.head()

,people_id,activity_id,date,activity_category,char_1,char_2,char_3,char_4,char_5,char_6,char_7,char_8,char_9,char_10
0,ppl_100004,act1_249281,2022-07-20,type 1,type 5,type 10,type 5,type 1,type 6,type 1,type 1,type 7,type 4,NaN
1,ppl_100004,act2_230855,2022-07-20,type 5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 682
2,ppl_10001,act1_240724,2022-10-14,type 1,type 12,type 1,type 5,type 4,type 6,type 1,type 1,type 13,type 10,NaN
3,ppl_10001,act1_83552,2022-11-27,type 1,type 20,type 10,type 5,type 4,type 6,type 1,type 1,type 5,type 5,NaN
4,ppl_10001,act2_1043301,2022-10-15,type 5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 3015

In [112]:
train_df = pd.read_csv('./Data/act_train.csv')
train_df.head()

,people_id,activity_id,date,activity_category,char_1,char_2,char_3,char_4,char_5,char_6,char_7,char_8,char_9,char_10,outcome
0,ppl_100,act2_1734928,2023-08-26,type 4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 76,0
1,ppl_100,act2_2434093,2022-09-27,type 2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 1,0
2,ppl_100,act2_3404049,2022-09-27,type 2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 1,0
3,ppl_100,act2_3651215,2023-08-04,type 2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 1,0
4,ppl_100,act2_4109017,2023-08-26,type 2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 1,0

In [113]:
people_df = pd.read_csv('./Data/people.csv')
people_df.head()

,people_id,char_1,group_1,char_2,date,char_3,char_4,char_5,char_6,char_7,...,char_29,char_30,char_31,char_32,char_33,char_34,char_35,char_36,char_37,char_38
0,ppl_100,type 2,group 17304,type 2,2021-06-29,type 5,type 5,type 5,type 3,type 11,...,False,True,True,False,False,True,True,True,False,36
1,ppl_100002,type 2,group 8688,type 3,2021-01-06,type 28,type 9,type 5,type 3,type 11,...,False,True,True,True,True,True,True,True,False,76
2,ppl_100003,type 2,group 33592,type 3,2022-06-10,type 4,type 8,type 5,type 2,type 5,...,False,False,True,True,True,True,False,True,True,99
3,ppl_100004,type 2,group 22593,type 3,2022-07-20,type 40,type 25,type 9,type 4,type 16,...,True,True,True,True,True,True,True,True,True,76
4,ppl_100006,type 2,group 6534,type 3,2022-07-27,type 40,type 25,type 9,type 3,type 8,...,False,False,True,False,False,False,True,True,False,84

## Preprocessing the Input data sets

In [114]:
# since the data columns are similar in
people_df['date'] = pd.to_datetime(people_df['date'])
train_df['date'] = pd.to_datetime(train_df['date'])
test_df['date'] = pd.to_datetime(test_df['date'])

In [81]:
# Convert similarly named terms in the two datasets ...
# ppl = people_df.rename(columns=dict({name: '_'.join(['ppl', name]) for name in people_df.columns if 'char' in name},
#                                     **{'date': 'ppl_date', 'group_1': 'ppl_group', 'people_id': 'ppl_id'}))

In [115]:
# activ = train_df.rename(columns=dict({name: '_'.join(['act', name]) for name in train_df.columns if 'char' in name},
#                                      **{'activity_category': 'act_category', 'date': 'act_date',
#                                         'activity_id': 'act_id', 'outcome': 'act_outcome', 'people_id': 'ppl_id'}))
# activ.columns

In [116]:
people_df

,people_id,char_1,group_1,char_2,date,char_3,char_4,char_5,char_6,char_7,...,char_29,char_30,char_31,char_32,char_33,char_34,char_35,char_36,char_37,char_38
0,ppl_100,type 2,group 17304,type 2,2021-06-29,type 5,type 5,type 5,type 3,type 11,...,False,True,True,False,False,True,True,True,False,36
1,ppl_100002,type 2,group 8688,type 3,2021-01-06,type 28,type 9,type 5,type 3,type 11,...,False,True,True,True,True,True,True,True,False,76
2,ppl_100003,type 2,group 33592,type 3,2022-06-10,type 4,type 8,type 5,type 2,type 5,...,False,False,True,True,True,True,False,True,True,99
3,ppl_100004,type 2,group 22593,type 3,2022-07-20,type 40,type 25,type 9,type 4,type 16,...,True,True,True,True,True,True,True,True,True,76
4,ppl_100006,type 2,group 6534,type 3,2022-07-27,type 40,type 25,type 9,type 3,type 8,...,False,False,True,False,False,False,True,True,False,84
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
189113,ppl_99987,type 1,group 8600,type 1,2022-04-02,type 4,type 6,type 4,type 3,type 11,...,False,False,False,True,False,True,False,True,True,89
189114,ppl_9999,type 2,group 17304,type 2,2023-02-23,type 6,type 2,type 8,type 3,type 11,...,False,False,False,False,False,False,False,False,False,0
189115,ppl_99992,type 2,group 17304,type 2,2020-06-25,type 5,type 5,type 3,type 4,type 16,...,False,False,False,False,False,False,False,False,False,0
189116,ppl_99994,type 2,group 17764,type 3,2023-01-06,type 2,type 7,type 2,type 1,type 2,...,True,True,True,True,False,True,True,True,True,95
189117,ppl_99997,type 2,group 17304,type 2,2022-03-12,type 40,type 25,type 9,type 3,type 8,...,False,False,False,False,False,False,False,False,False,36

In [117]:
train_df.columns

Index(['people_id', 'activity_id', 'date', 'activity_category', 'char_1',
       'char_2', 'char_3', 'char_4', 'char_5', 'char_6', 'char_7', 'char_8',
       'char_9', 'char_10', 'outcome'],
      dtype='object')

In [118]:
## Renaming the similarly named columns keeping primary and foreign key consistent :
people_df.columns = ['ppl_' + str(col) for col in people_df.columns]
people_df.rename(columns={'ppl_people_id': 'people_id', 'ppl_group_1': 'ppl_group'}, inplace=True)
train_df.columns = ['act_' + str(col) for col in train_df.columns]
train_df.rename(columns={'act_people_id': 'people_id', 'act_activity_category': 'activity_category',
                         'act_activity_id': 'activity_id', 'act_outcome': 'outcome'}, inplace=True)
test_df.columns = ['act_' + str(col) for col in test_df.columns]
test_df.rename(columns={'act_people_id': 'people_id', 'act_activity_category': 'activity_category',
                        'act_activity_id': 'activity_id', 'act_outcome': 'outcome'}, inplace=True)

In [119]:
people_df.head()

,people_id,ppl_char_1,ppl_group,ppl_char_2,ppl_date,ppl_char_3,ppl_char_4,ppl_char_5,ppl_char_6,ppl_char_7,...,ppl_char_29,ppl_char_30,ppl_char_31,ppl_char_32,ppl_char_33,ppl_char_34,ppl_char_35,ppl_char_36,ppl_char_37,ppl_char_38
0,ppl_100,type 2,group 17304,type 2,2021-06-29,type 5,type 5,type 5,type 3,type 11,...,False,True,True,False,False,True,True,True,False,36
1,ppl_100002,type 2,group 8688,type 3,2021-01-06,type 28,type 9,type 5,type 3,type 11,...,False,True,True,True,True,True,True,True,False,76
2,ppl_100003,type 2,group 33592,type 3,2022-06-10,type 4,type 8,type 5,type 2,type 5,...,False,False,True,True,True,True,False,True,True,99
3,ppl_100004,type 2,group 22593,type 3,2022-07-20,type 40,type 25,type 9,type 4,type 16,...,True,True,True,True,True,True,True,True,True,76
4,ppl_100006,type 2,group 6534,type 3,2022-07-27,type 40,type 25,type 9,type 3,type 8,...,False,False,True,False,False,False,True,True,False,84

In [120]:
train_df.head()

,people_id,activity_id,act_date,activity_category,act_char_1,act_char_2,act_char_3,act_char_4,act_char_5,act_char_6,act_char_7,act_char_8,act_char_9,act_char_10,outcome
0,ppl_100,act2_1734928,2023-08-26,type 4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 76,0
1,ppl_100,act2_2434093,2022-09-27,type 2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 1,0
2,ppl_100,act2_3404049,2022-09-27,type 2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 1,0
3,ppl_100,act2_3651215,2023-08-04,type 2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 1,0
4,ppl_100,act2_4109017,2023-08-26,type 2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 1,0

In [121]:
test_df.head()

,people_id,activity_id,act_date,activity_category,act_char_1,act_char_2,act_char_3,act_char_4,act_char_5,act_char_6,act_char_7,act_char_8,act_char_9,act_char_10
0,ppl_100004,act1_249281,2022-07-20,type 1,type 5,type 10,type 5,type 1,type 6,type 1,type 1,type 7,type 4,NaN
1,ppl_100004,act2_230855,2022-07-20,type 5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 682
2,ppl_10001,act1_240724,2022-10-14,type 1,type 12,type 1,type 5,type 4,type 6,type 1,type 1,type 13,type 10,NaN
3,ppl_10001,act1_83552,2022-11-27,type 1,type 20,type 10,type 5,type 4,type 6,type 1,type 1,type 5,type 5,NaN
4,ppl_10001,act2_1043301,2022-10-15,type 5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,type 3015

In [123]:
# sorting of columns
people_df = people_df[['people_id', 'ppl_date',  'ppl_group', 'ppl_char_1', 'ppl_char_2'] + people_df.columns[5:].to_list()]
# Convering
people_columns = people_df.columns.to_list()[3:12]

people_df[['ppl_group'] + people_columns] = people_df[['ppl_group'] + people_columns].astype('category')

In [124]:
people_df

,people_id,ppl_date,ppl_group,ppl_char_1,ppl_char_2,ppl_char_3,ppl_char_4,ppl_char_5,ppl_char_6,ppl_char_7,...,ppl_char_29,ppl_char_30,ppl_char_31,ppl_char_32,ppl_char_33,ppl_char_34,ppl_char_35,ppl_char_36,ppl_char_37,ppl_char_38
0,ppl_100,2021-06-29,group 17304,type 2,type 2,type 5,type 5,type 5,type 3,type 11,...,False,True,True,False,False,True,True,True,False,36
1,ppl_100002,2021-01-06,group 8688,type 2,type 3,type 28,type 9,type 5,type 3,type 11,...,False,True,True,True,True,True,True,True,False,76
2,ppl_100003,2022-06-10,group 33592,type 2,type 3,type 4,type 8,type 5,type 2,type 5,...,False,False,True,True,True,True,False,True,True,99
3,ppl_100004,2022-07-20,group 22593,type 2,type 3,type 40,type 25,type 9,type 4,type 16,...,True,True,True,True,True,True,True,True,True,76
4,ppl_100006,2022-07-27,group 6534,type 2,type 3,type 40,type 25,type 9,type 3,type 8,...,False,False,True,False,False,False,True,True,False,84
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
189113,ppl_99987,2022-04-02,group 8600,type 1,type 1,type 4,type 6,type 4,type 3,type 11,...,False,False,False,True,False,True,False,True,True,89
189114,ppl_9999,2023-02-23,group 17304,type 2,type 2,type 6,type 2,type 8,type 3,type 11,...,False,False,False,False,False,False,False,False,False,0
189115,ppl_99992,2020-06-25,group 17304,type 2,type 2,type 5,type 5,type 3,type 4,type 16,...,False,False,False,False,False,False,False,False,False,0
189116,ppl_99994,2023-01-06,group 17764,type 2,type 3,type 2,type 7,type 2,type 1,type 2,...,True,True,True,True,False,True,True,True,True,95
189117,ppl_99997,2022-03-12,group 17304,type 2,type 2,type 40,type 25,type 9,type 3,type 8,...,False,False,False,False,False,False,False,False,False,36

In [125]:
people_df.dtypes

people_id        object
ppl_date       category
ppl_group      category
ppl_char_1     category
ppl_char_2     category
ppl_char_3     category
ppl_char_4     category
ppl_char_5     category
ppl_char_6     category
ppl_char_7     category
ppl_char_8     category
ppl_char_9     category
ppl_char_10        bool
ppl_char_11        bool
ppl_char_12        bool
ppl_char_13        bool
ppl_char_14        bool
ppl_char_15        bool
ppl_char_16        bool
ppl_char_17        bool
ppl_char_18        bool
ppl_char_19        bool
ppl_char_20        bool
ppl_char_21        bool
ppl_char_22        bool
ppl_char_23        bool
ppl_char_24        bool
ppl_char_25        bool
ppl_char_26        bool
ppl_char_27        bool
ppl_char_28        bool
ppl_char_29        bool
ppl_char_30        bool
ppl_char_31        bool
ppl_char_32        bool
ppl_char_33        bool
ppl_char_34        bool
ppl_char_35        bool
ppl_char_36        bool
ppl_char_37        bool
ppl_char_38       int64
dtype: object

In [127]:
activity_category = test_df.columns.to_list()[3:14]
test_df[activity_category] = test_df[activity_category].astype('category')
train_df[activity_category] = train_df[activity_category].astype('category')

In [135]:
## Checking for null values :
# People dataset
print('People data null values : \n')
print(people_df.info(show_counts=True))
print('-----------------------------------------------------------------\n')
print('Train data null values : \n')
print(train_df.info(show_counts=True))
print('-----------------------------------------------------------------\n')
print('Test data null values : \n')
print(test_df.info(show_counts=True))
print('-----------------------------------------------------------------\n')

People data null values :

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 189118 entries, 0 to 189117
Data columns (total 41 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   people_id    189118 non-null  object
 1   ppl_date     189118 non-null  category
 2   ppl_group    189118 non-null  category
 3   ppl_char_1   189118 non-null  category
 4   ppl_char_2   189118 non-null  category
 5   ppl_char_3   189118 non-null  category
 6   ppl_char_4   189118 non-null  category
 7   ppl_char_5   189118 non-null  category
 8   ppl_char_6   189118 non-null  category
 9   ppl_char_7   189118 non-null  category
 10  ppl_char_8   189118 non-null  category
 11  ppl_char_9   189118 non-null  category
 12  ppl_char_10  189118 non-null  bool
 13  ppl_char_11  189118 non-null  bool
 14  ppl_char_12  189118 non-null  bool
 15  ppl_char_13  189118 non-null  bool
 16  ppl_char_14  189118 non-null  bool
 17  ppl_char_15  189118 non-null  bool
 18  ppl_char_16  189118 non-null  bool
 19  ppl_char_17  189118 non-null  bool
 20  ppl_char_18  189118 non-null  bool
 21  ppl_char_19  189118 non-null  bool
 22  ppl_char_20  189118 non-null  bool
 23  ppl_char_21  189118 non-null  bool
 24  ppl_char_22  189118 non-null  bool
 25  ppl_char_23  189118 non-null  bool
 26  ppl_char_24  189118 non-null  bool
 27  ppl_char_25  189118 non-null  bool
 28  ppl_char_26  189118 non-null  bool
 29  ppl_char_27  189118 non-null  bool
 30  ppl_char_28  189118 non-null  bool
 31  ppl_char_29  189118 non-null  bool
 32  ppl_char_30  189118 non-null  bool
 33  ppl_char_31  189118 non-null  bool
 34  ppl_char_32  189118 non-null  bool
 35  ppl_char_33  189118 non-null  bool
 36  ppl_char_34  189118 non-null  bool
 37  ppl_char_35  189118 non-null  bool
 38  ppl_char_36  189118 non-null  bool
 39  ppl_char_37  189118 non-null  bool
 40  ppl_char_38  189118 non-null  int64
dtypes: bool(28), category(11), int64(1), object(1)
memory usage: 12.0+ MB
None
-----------------------------------------------------------------

Train data null values :

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2197291 entries, 0 to 2197290
Data columns (total 15 columns):
 #   Column             Non-Null Count    Dtype
---  ------             --------------    -----
 0   people_id          2197291 non-null  object
 1   activity_id        2197291 non-null  object
 2   act_date           2197291 non-null  datetime64[ns]
 3   activity_category  2197291 non-null  category
 4   act_char_1         157615 non-null   category
 5   act_char_2         157615 non-null   category
 6   act_char_3         157615 non-null   category
 7   act_char_4         157615 non-null   category
 8   act_char_5         157615 non-null   category
 9   act_char_6         157615 non-null   category
 10  act_char_7         157615 non-null   category
 11  act_char_8         157615 non-null   category
 12  act_char_9         157615 non-null   category
 13  act_char_10        2039676 non-null  category
 14  outcome            2197291 non-null  int64
dtypes: category(11), datetime64[ns](1), int64(1), object(2)
memory usage: 92.5+ MB
None
-----------------------------------------------------------------

Test data null values :

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 498687 entries, 0 to 498686
Data columns (total 14 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   people_id          498687 non-null  object
 1   activity_id        498687 non-null  object
 2   act_date           498687 non-null  datetime64[ns]
 3   activity_category  498687 non-null  category
 4   act_char_1         40092 non-null   category
 5   act_char_2         40092 non-null   category
 6   act_char_3         40092 non-null   category
 7   act_char_4         40092 non-null   category
 8   act_char_5         40092 non-null   category
 9   act_char_6         40092 non-null   category
 10  act_char_7         40092 non-null   category
 11  act_char_8         40092 non-null   category
 12  act_char_9         40092 non-null   category
 13  act_char_10        458595 non-null  category
dtypes: category(11), datetime64[ns](1), object(2)
memory usage: 17.3+ MB
None
-----------------------------------------------------------------

people_id                    object
activity_id                  object
act_date             datetime64[ns]
activity_category          category
act_char_1                 category
act_char_2                 category
act_char_3                 category
act_char_4                 category
act_char_5                 category
act_char_6                 category
act_char_7                 category
act_char_8                 category
act_char_9                 category
act_char_10                category
dtype: object